Erulathra/Wbudy-STM32-Snake/src/main.c
#include <stdio.h>
#include <stdlib.h>
#include "stm32f1xx_hal.h"
#include "ST7735.h"
#include "ST7735_buffer.h"
#include "DS18B20.h"
#include "ftoa.h"
#include "system_init.h"
#include "interrupts_handlers.h"
#include "game_engine.h"
#pragma clang diagnostic push
#pragma ide diagnostic ignored "EndlessLoop"
SPI_HandleTypeDef spi;
DMA_HandleTypeDef dma1;
DMA_HandleTypeDef dma3;
TIM_HandleTypeDef tim2;
TIM_HandleTypeDef tim3;

int main(void) {
#ifdef clock128
    SystemClock_Config128();
#else
    SystemClock_Config72();
#endif
    HAL_Init();
    DMA_Init();
    MX_DMA_Init();
    GPIO_INIT();
    SPI_INIT();
    TIM_INIT();
    HAL_SPI_MspInit(&spi);
    if (HAL_SPI_Init(&spi) != HAL_OK) {
    }
    ST7735_Init();
    ST7735_FillScreen(ST7735_BLUE);

    __HAL_RCC_ADC1_CLK_ENABLE();

    ADC_HandleTypeDef adc;
    adc.Instance = ADC1;
    adc.Init.ContinuousConvMode = ENABLE;
    adc.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    adc.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    adc.Init.ScanConvMode = ADC_SCAN_DISABLE;
    adc.Init.NbrOfConversion = 1;
    adc.Init.DiscontinuousConvMode = DISABLE;
    adc.Init.NbrOfDiscConversion = 1;
    HAL_ADC_Init(&adc);

    HAL_ADCEx_Calibration_Start(&adc);


    while(1){
        HAL_ADC_Start(&adc);
        HAL_ADC_PollForConversion(&adc, 10);

        uint32_t value = HAL_ADC_GetValue(&adc);
        printf("ADC = %lu\n", value);

        HAL_Delay(250);
    }
}